#### 📖 Terraform Plan ('src/common/prod') - failure
<details>
<summary>Terraform Plan</summary>

```hcl
module.apim_itn.data.azurerm_linux_web_app.cgn_pe_backend_app_01: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_practices_app_itn: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_payments_app_itn: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_selfcare_be: Still reading... [10s elapsed]
data.azurerm_linux_function_app.wallet_user: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.cms_backoffice_app_itn: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_vehicles_app_itn: Still reading... [10s elapsed]
data.azurerm_linux_function_app.function_assets_cdn: Still reading... [10s elapsed]
data.azurerm_linux_function_app.services_app_backend_function_app: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_devportal_be: Still reading... [10s elapsed]
module.apim_itn.data.azurerm_linux_web_app.cgn_pe_backend_app_01: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_practices_app_itn: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_payments_app_itn: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_selfcare_be: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.cms_backoffice_app_itn: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_vehicles_app_itn: Still reading... [20s elapsed]
data.azurerm_linux_function_app.function_assets_cdn: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_devportal_be: Still reading... [20s elapsed]
data.azurerm_linux_function_app.lollipop_function: Still reading... [10s elapsed]
data.azurerm_linux_function_app.com_citizen_func: Still reading... [10s elapsed]
data.azurerm_linux_web_app.firmaconio_selfcare_web_app: Still reading... [10s elapsed]
data.azurerm_linux_function_app.io_sign_user: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_licences_app_itn: Still reading... [10s elapsed]
data.azurerm_linux_function_app.function_profile: Still reading... [10s elapsed]
data.azurerm_linux_function_app.eucovidcert: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.session_manager_03: Still reading... [10s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_continua: Still reading... [10s elapsed]
data.azurerm_linux_function_app.io_fims_user: Still reading... [10s elapsed]
data.azurerm_linux_web_app.firmaconio_selfcare_web_app: Still reading... [20s elapsed]
data.azurerm_linux_function_app.io_sign_user: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.ipatente_licences_app_itn: Still reading... [20s elapsed]
data.azurerm_linux_function_app.eucovidcert: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.session_manager_03: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.appservice_continua: Still reading... [20s elapsed]
data.azurerm_linux_function_app.io_fims_user: Still reading... [20s elapsed]
module.application_gateway_weu.data.azurerm_linux_web_app.fims_op_app: Still reading... [10s elapsed]
Error: checking for presence of an existing Service (Subscription: "ec285037-c673-4f58-b594-d7c480da4e8b"
Resource Group Name: "io-p-itn-common-rg-01"
Service Name: "io-p-itn-apim-01-autoscale"): unexpected status 404 (404 Not Found) with error: ResourceNotFound: The Resource 'Microsoft.ApiManagement/service/io-p-itn-apim-01-autoscale' under resource group 'io-p-itn-common-rg-01' was not found. For more details please go to https://aka.ms/ARMResourceNotFoundFix

  with module.apim_itn.module.iam_adgroup_auth_admins.module.apim.data.azurerm_api_management.this["io-p-itn-common-rg-01|io-p-itn-apim-01-autoscale"],
  on .terraform/modules/apim_itn.iam_adgroup_auth_admins/modules/apim/data.tf line 1, in data "azurerm_api_management" "this":
   1: data "azurerm_api_management" "this" {


Error: checking for presence of an existing Service (Subscription: "ec285037-c673-4f58-b594-d7c480da4e8b"
Resource Group Name: "io-p-itn-common-rg-01"
Service Name: "io-p-itn-apim-01-autoscale"): unexpected status 404 (404 Not Found) with error: ResourceNotFound: The Resource 'Microsoft.ApiManagement/service/io-p-itn-apim-01-autoscale' under resource group 'io-p-itn-common-rg-01' was not found. For more details please go to https://aka.ms/ARMResourceNotFoundFix

  with module.apim_itn.module.iam_adgroup_bonus_admins.module.apim.data.azurerm_api_management.this["io-p-itn-common-rg-01|io-p-itn-apim-01-autoscale"],
  on .terraform/modules/apim_itn.iam_adgroup_bonus_admins/modules/apim/data.tf line 1, in data "azurerm_api_management" "this":
   1: data "azurerm_api_management" "this" {


Error: checking for presence of an existing Service (Subscription: "ec285037-c673-4f58-b594-d7c480da4e8b"
Resource Group Name: "io-p-itn-common-rg-01"
Service Name: "io-p-itn-apim-01-autoscale"): unexpected status 404 (404 Not Found) with error: ResourceNotFound: The Resource 'Microsoft.ApiManagement/service/io-p-itn-apim-01-autoscale' under resource group 'io-p-itn-common-rg-01' was not found. For more details please go to https://aka.ms/ARMResourceNotFoundFix

  with module.apim_itn.module.iam_adgroup_com_admins.module.apim.data.azurerm_api_management.this["io-p-itn-common-rg-01|io-p-itn-apim-01-autoscale"],
  on .terraform/modules/apim_itn.iam_adgroup_com_admins/modules/apim/data.tf line 1, in data "azurerm_api_management" "this":
   1: data "azurerm_api_management" "this" {


Error: checking for presence of an existing Service (Subscription: "ec285037-c673-4f58-b594-d7c480da4e8b"
Resource Group Name: "io-p-itn-common-rg-01"
Service Name: "io-p-itn-apim-01-autoscale"): unexpected status 404 (404 Not Found) with error: ResourceNotFound: The Resource 'Microsoft.ApiManagement/service/io-p-itn-apim-01-autoscale' under resource group 'io-p-itn-common-rg-01' was not found. For more details please go to https://aka.ms/ARMResourceNotFoundFix

  with module.apim_itn.module.iam_adgroup_svc_admins.module.apim.data.azurerm_api_management.this["io-p-itn-common-rg-01|io-p-itn-apim-01-autoscale"],
  on .terraform/modules/apim_itn.iam_adgroup_svc_admins/modules/apim/data.tf line 1, in data "azurerm_api_management" "this":
   1: data "azurerm_api_management" "this" {


Error: checking for presence of an existing Service (Subscription: "ec285037-c673-4f58-b594-d7c480da4e8b"
Resource Group Name: "io-p-itn-common-rg-01"
Service Name: "io-p-itn-apim-01-autoscale"): unexpected status 404 (404 Not Found) with error: ResourceNotFound: The Resource 'Microsoft.ApiManagement/service/io-p-itn-apim-01-autoscale' under resource group 'io-p-itn-common-rg-01' was not found. For more details please go to https://aka.ms/ARMResourceNotFoundFix

  with module.apim_itn.module.iam_adgroup_wallet_admins.module.apim.data.azurerm_api_management.this["io-p-itn-common-rg-01|io-p-itn-apim-01-autoscale"],
  on .terraform/modules/apim_itn.iam_adgroup_wallet_admins/modules/apim/data.tf line 1, in data "azurerm_api_management" "this":
   1: data "azurerm_api_management" "this" {


Error: checking for presence of an existing Service (Subscription: "ec285037-c673-4f58-b594-d7c480da4e8b"
Resource Group Name: "io-p-itn-common-rg-01"
Service Name: "io-p-itn-apim-01-autoscale"): unexpected status 404 (404 Not Found) with error: ResourceNotFound: The Resource 'Microsoft.ApiManagement/service/io-p-itn-apim-01-autoscale' under resource group 'io-p-itn-common-rg-01' was not found. For more details please go to https://aka.ms/ARMResourceNotFoundFix

  with module.apim_itn.module.iam_cgn_pe_backend_app_01.module.apim.data.azurerm_api_management.this["io-p-itn-common-rg-01|io-p-itn-apim-01-autoscale"],
  on .terraform/modules/apim_itn.iam_cgn_pe_backend_app_01/modules/apim/data.tf line 1, in data "azurerm_api_management" "this":
   1: data "azurerm_api_management" "this" {

ure.net/secrets/appbackend-ALLOW-MYPORTAL-IP-SOURCE-RANGE/0c51e8a44e204363aecca6104466e55c]
module.apim_itn.module.apim_v2.azurerm_network_security_group.nsg_apim: Preparing import... [id=/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/networkSecurityGroups/io-p-itn-apim-nsg-01]
module.apim_itn.module.apim_v2.azurerm_subnet_network_security_group_association.snet_nsg: Preparing import... [id=/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-apim-snet-01]
module.application_gateway_weu.data.azurerm_linux_web_app.fims_op_app: Still reading... [20s elapsed]
module.apim_itn.module.apim_v2.azurerm_private_dns_a_record.apim_management_azure_api_net: Preparing import... [id=/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/management.azure-api.net/A/io-p-itn-apim-01]
module.apim_itn.module.apim_v2.azurerm_private_dns_a_record.apim_azure_api_net: Preparing import... [id=/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/azure-api.net/A/io-p-itn-apim-01]
module.apim_itn.module.apim_v2.azurerm_private_dns_a_record.apim_scm_azure_api_net: Preparing import... [id=/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/scm.azure-api.net/A/io-p-itn-apim-01]
module.apim_itn.module.apim_v2.azurerm_api_management_diagnostic.applicationinsights[0]: Preparing import... [id=/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/diagnostics/applicationinsights]
module.apim_itn.module.iam_adgroup_svc_admins.module.apim.data.azurerm_api_management.this["io-p-itn-common-rg-01|io-p-itn-apim-01-autoscale"]: Still reading... [10s elapsed]
module.apim_itn.module.iam_adgroup_auth_admins.module.apim.data.azurerm_api_management.this["io-p-itn-common-rg-01|io-p-itn-apim-01-autoscale"]: Still reading... [10s elapsed]
module.apim_itn.module.iam_adgroup_com_admins.module.apim.data.azurerm_api_management.this["io-p-itn-common-rg-01|io-p-itn-apim-01-autoscale"]: Still reading... [10s elapsed]
module.apim_itn.module.iam_adgroup_wallet_admins.module.apim.data.azurerm_api_management.this["io-p-itn-common-rg-01|io-p-itn-apim-01-autoscale"]: Still reading... [10s elapsed]
module.apim_itn.module.iam_adgroup_bonus_admins.module.apim.data.azurerm_api_management.this["io-p-itn-common-rg-01|io-p-itn-apim-01-autoscale"]: Still reading... [10s elapsed]
module.apim_itn.module.iam_cgn_pe_backend_app_01.module.apim.data.azurerm_api_management.this["io-p-itn-common-rg-01|io-p-itn-apim-01-autoscale"]: Still reading... [10s elapsed]
module.apim_itn.module.iam_adgroup_svc_admins.module.apim.data.azurerm_api_management.this["io-p-itn-common-rg-01|io-p-itn-apim-01-autoscale"]: Still reading... [20s elapsed]
module.apim_itn.module.iam_adgroup_auth_admins.module.apim.data.azurerm_api_management.this["io-p-itn-common-rg-01|io-p-itn-apim-01-autoscale"]: Still reading... [20s elapsed]
module.apim_itn.module.iam_adgroup_com_admins.module.apim.data.azurerm_api_management.this["io-p-itn-common-rg-01|io-p-itn-apim-01-autoscale"]: Still reading... [20s elapsed]
module.apim_itn.module.iam_adgroup_wallet_admins.module.apim.data.azurerm_api_management.this["io-p-itn-common-rg-01|io-p-itn-apim-01-autoscale"]: Still reading... [20s elapsed]
module.apim_itn.module.iam_adgroup_bonus_admins.module.apim.data.azurerm_api_management.this["io-p-itn-common-rg-01|io-p-itn-apim-01-autoscale"]: Still reading... [20s elapsed]
module.apim_itn.module.iam_cgn_pe_backend_app_01.module.apim.data.azurerm_api_management.this["io-p-itn-common-rg-01|io-p-itn-apim-01-autoscale"]: Still reading... [20s elapsed]
module.apim_itn.module.iam_adgroup_svc_admins.module.apim.data.azurerm_api_management.this["io-p-itn-common-rg-01|io-p-itn-apim-01-autoscale"]: Still reading... [30s elapsed]
module.apim_itn.module.iam_adgroup_auth_admins.module.apim.data.azurerm_api_management.this["io-p-itn-common-rg-01|io-p-itn-apim-01-autoscale"]: Still reading... [30s elapsed]
module.apim_itn.module.iam_adgroup_com_admins.module.apim.data.azurerm_api_management.this["io-p-itn-common-rg-01|io-p-itn-apim-01-autoscale"]: Still reading... [30s elapsed]
module.apim_itn.module.iam_adgroup_wallet_admins.module.apim.data.azurerm_api_management.this["io-p-itn-common-rg-01|io-p-itn-apim-01-autoscale"]: Still reading... [30s elapsed]
module.apim_itn.module.iam_adgroup_bonus_admins.module.apim.data.azurerm_api_management.this["io-p-itn-common-rg-01|io-p-itn-apim-01-autoscale"]: Still reading... [30s elapsed]
module.apim_itn.module.iam_cgn_pe_backend_app_01.module.apim.data.azurerm_api_management.this["io-p-itn-common-rg-01|io-p-itn-apim-01-autoscale"]: Still reading... [30s elapsed]
module.apim_itn.module.iam_adgroup_svc_admins.module.apim.data.azurerm_api_management.this["io-p-itn-common-rg-01|io-p-itn-apim-01-autoscale"]: Still reading... [40s elapsed]
module.apim_itn.module.iam_adgroup_auth_admins.module.apim.data.azurerm_api_management.this["io-p-itn-common-rg-01|io-p-itn-apim-01-autoscale"]: Still reading... [40s elapsed]
module.apim_itn.module.iam_adgroup_com_admins.module.apim.data.azurerm_api_management.this["io-p-itn-common-rg-01|io-p-itn-apim-01-autoscale"]: Still reading... [40s elapsed]
module.apim_itn.module.iam_adgroup_wallet_admins.module.apim.data.azurerm_api_management.this["io-p-itn-common-rg-01|io-p-itn-apim-01-autoscale"]: Still reading... [40s elapsed]
module.apim_itn.module.iam_adgroup_bonus_admins.module.apim.data.azurerm_api_management.this["io-p-itn-common-rg-01|io-p-itn-apim-01-autoscale"]: Still reading... [40s elapsed]
module.apim_itn.module.iam_cgn_pe_backend_app_01.module.apim.data.azurerm_api_management.this["io-p-itn-common-rg-01|io-p-itn-apim-01-autoscale"]: Still reading... [40s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

-/+ resource "azurerm_role_assignment" "apim_client_role" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/providers/Microsoft.Authorization/roleAssignments/25d255dc-30ab-4f20-fe95-8723761a4f3f" -> (known after apply)
      ~ name                                   = "25d255dc-30ab-4f20-fe95-8723761a4f3f" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/71522526-b88f-4d52-b57f-d31fc3546d0d" -> (known after apply)
      ~ scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_role_assignment.apim_client_role["Contributor"] must be replaced
-/+ resource "azurerm_role_assignment" "apim_client_role" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/providers/Microsoft.Authorization/roleAssignments/bb2b27b7-4388-de4f-7558-17ca26d44677" -> (known after apply)
      ~ name                                   = "bb2b27b7-4388-de4f-7558-17ca26d44677" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> (known after apply)
      ~ scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

-/+ resource "azurerm_role_assignment" "apim_client_role" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/providers/Microsoft.Authorization/roleAssignments/a59f2e3d-0014-3078-3cc4-7c1ab47eb8f4" -> (known after apply)
      ~ name                                   = "a59f2e3d-0014-3078-3cc4-7c1ab47eb8f4" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/acdd72a7-3385-48ef-bd42-f606fba81ae7" -> (known after apply)
      ~ scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

-/+ resource "azurerm_role_assignment" "dev_portal_role" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/providers/Microsoft.Authorization/roleAssignments/e33c82aa-a3ff-618d-d122-b10e5f97bb6c" -> (known after apply)
      ~ name                                   = "e33c82aa-a3ff-618d-d122-b10e5f97bb6c" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/71522526-b88f-4d52-b57f-d31fc3546d0d" -> (known after apply)
      ~ scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_role_assignment.dev_portal_role["Contributor"] must be replaced
-/+ resource "azurerm_role_assignment" "dev_portal_role" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/providers/Microsoft.Authorization/roleAssignments/a7ae30ff-8ad1-9233-bcea-319dfbf9a2fb" -> (known after apply)
      ~ name                                   = "a7ae30ff-8ad1-9233-bcea-319dfbf9a2fb" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> (known after apply)
      ~ scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

-/+ resource "azurerm_role_assignment" "dev_portal_role" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/providers/Microsoft.Authorization/roleAssignments/780e9e7f-541a-4c18-67e1-593d5b66e3fd" -> (known after apply)
      ~ name                                   = "780e9e7f-541a-4c18-67e1-593d5b66e3fd" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/acdd72a7-3385-48ef-bd42-f606fba81ae7" -> (known after apply)
      ~ scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_role_assignment.svc_devs_itn must be replaced
-/+ resource "azurerm_role_assignment" "svc_devs_itn" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/providers/Microsoft.Authorization/roleAssignments/e35e05d6-2084-b2b9-e925-cc961360629b" -> (known after apply)
      ~ name                                   = "e35e05d6-2084-b2b9-e925-cc961360629b" -> (known after apply)
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/782f0ee9-2d66-ac22-6b31-aefcf554c8f0" -> (known after apply)
      ~ scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.apim_itn.azurerm_key_vault_access_policy.apim_v2_kv_policy must be replaced
-/+ resource "azurerm_key_vault_access_policy" "apim_v2_kv_policy" {
      ~ id                      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-sec-rg/providers/Microsoft.KeyVault/vaults/io-p-kv/objectId/bef9fb72-7a41-44d1-9819-2f0b5020bad6" -> (known after apply)
      ~ object_id               = "bef9fb72-7a41-44d1-9819-2f0b5020bad6" -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.apim_itn.azurerm_key_vault_access_policy.v2_common must be replaced
-/+ resource "azurerm_key_vault_access_policy" "v2_common" {
      ~ id                      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.KeyVault/vaults/io-p-kv-common/objectId/bef9fb72-7a41-44d1-9819-2f0b5020bad6" -> (known after apply)
      ~ object_id               = "bef9fb72-7a41-44d1-9819-2f0b5020bad6" -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.apim_itn.azurerm_private_dns_a_record.apim_azure_api_net will be destroyed
  # (because azurerm_private_dns_a_record.apim_azure_api_net is not in configuration)
  - resource "azurerm_private_dns_a_record" "apim_azure_api_net" {
      - fqdn                = "io-p-itn-apim-01.azure-api.net." -> null
      - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/azure-api.net/A/io-p-itn-apim-01" -> null
      - name                = "io-p-itn-apim-01" -> null
      - records             = [
          - "10.20.100.4",
        ] -> null
      - resource_group_name = "io-p-rg-common" -> null
      - tags                = {
          - "BusinessUnit"   = "App IO"
          - "CostCenter"     = "TS000 - Tecnologia e Servizi"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Prod"
          - "ManagementTeam" = "IO Platform"
          - "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        } -> null
      - ttl                 = 3600 -> null
      - zone_name           = "azure-api.net" -> null
    }

  # module.apim_itn.azurerm_private_dns_a_record.apim_management_azure_api_net will be destroyed
  # (because azurerm_private_dns_a_record.apim_management_azure_api_net is not in configuration)
  - resource "azurerm_private_dns_a_record" "apim_management_azure_api_net" {
      - fqdn                = "io-p-itn-apim-01.management.azure-api.net." -> null
      - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/management.azure-api.net/A/io-p-itn-apim-01" -> null
      - name                = "io-p-itn-apim-01" -> null
      - records             = [
          - "10.20.100.4",
        ] -> null
      - resource_group_name = "io-p-rg-common" -> null
      - tags                = {
          - "BusinessUnit"   = "App IO"
          - "CostCenter"     = "TS000 - Tecnologia e Servizi"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Prod"
          - "ManagementTeam" = "IO Platform"
          - "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        } -> null
      - ttl                 = 3600 -> null
      - zone_name           = "management.azure-api.net" -> null
    }

  # module.apim_itn.azurerm_private_dns_a_record.apim_scm_azure_api_net will be destroyed
  # (because azurerm_private_dns_a_record.apim_scm_azure_api_net is not in configuration)
  - resource "azurerm_private_dns_a_record" "apim_scm_azure_api_net" {
      - fqdn                = "io-p-itn-apim-01.scm.azure-api.net." -> null
      - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/scm.azure-api.net/A/io-p-itn-apim-01" -> null
      - name                = "io-p-itn-apim-01" -> null
      - records             = [
          - "10.20.100.4",
        ] -> null
      - resource_group_name = "io-p-rg-common" -> null
      - tags                = {
          - "BusinessUnit"   = "App IO"
          - "CostCenter"     = "TS000 - Tecnologia e Servizi"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Prod"
          - "ManagementTeam" = "IO Platform"
          - "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        } -> null
      - ttl                 = 3600 -> null
      - zone_name           = "scm.azure-api.net" -> null
    }

  # module.application_gateway_weu.azurerm_web_application_firewall_policy.api_app will be updated in-place
  ~ resource "azurerm_web_application_firewall_policy" "api_app" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGatewayWebApplicationFirewallPolicies/io-p-waf-appgateway-api-app-policy"
        name                = "io-p-waf-appgateway-api-app-policy"
        tags                = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (4 unchanged attributes hidden)

      ~ policy_settings {
          ~ request_body_enforcement                  = false -> true
          ~ request_body_inspect_limit_in_kb          = 0 -> 128
            # (7 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.apim_itn.module.apim_v2.azurerm_api_management.this must be replaced
-/+ resource "azurerm_api_management" "this" {
      ~ developer_portal_url          = "https://io-p-itn-apim-01.developer.azure-api.net" -> (known after apply)
      ~ gateway_regional_url          = "https://io-p-itn-apim-01-italynorth-01.regional.azure-api.net" -> (known after apply)
      ~ gateway_url                   = "https://io-p-itn-apim-01.azure-api.net" -> (known after apply)
      ~ id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01" -> (known after apply)
      ~ management_api_url            = "https://io-p-itn-apim-01.management.azure-api.net" -> (known after apply)
      ~ name                          = "io-p-itn-apim-01" -> "io-p-itn-apim-01-autoscale" # forces replacement
      ~ portal_url                    = "https://io-p-itn-apim-01.portal.azure-api.net" -> (known after apply)
      ~ private_ip_addresses          = [
          - "10.20.100.4",
        ] -> (known after apply)
      ~ public_ip_addresses           = [
          - "72.146.49.183",
        ] -> (known after apply)
      ~ scm_url                       = "https://io-p-itn-apim-01.scm.azure-api.net" -> (known after apply)
        tags                          = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (13 unchanged attributes hidden)

      ~ delegation (known after apply)
      - delegation {
          - subscriptions_enabled     = false -> null
          - user_registration_enabled = false -> null
            # (2 unchanged attributes hidden)
        }

      ~ hostname_configuration {
          ~ proxy {
              ~ certificate_source              = "BuiltIn" -> (known after apply)
              + certificate_status              = (known after apply)
              + expiry                          = (known after apply)
              + subject                         = (known after apply)
              + thumbprint                      = (known after apply)
                # (7 unchanged attributes hidden)
            }
          ~ proxy {
              ~ certificate_source              = "KeyVault" -> (known after apply)
              + certificate_status              = (known after apply)
              ~ expiry                          = "2025-05-29T00:43:32+00:00" -> (known after apply)
              ~ subject                         = "CN=api-internal.io.italia.it" -> (known after apply)
              ~ thumbprint                      = "986D566BCA71AD52926EF77AD87B1F9A93101F98" -> (known after apply)
                # (7 unchanged attributes hidden)
            }
          ~ proxy {
              ~ certificate_source              = "KeyVault" -> (known after apply)
              + certificate_status              = (known after apply)
              ~ expiry                          = "2025-05-29T00:13:49+00:00" -> (known after apply)
              ~ subject                         = "CN=api-app.internal.io.pagopa.it" -> (known after apply)
              ~ thumbprint                      = "6368B46425EBA5A8A4A69B34369AEB37E629059C" -> (known after apply)
                # (7 unchanged attributes hidden)
            }
        }

      ~ identity {
          - identity_ids = [] -> null
          ~ principal_id = "bef9fb72-7a41-44d1-9819-2f0b5020bad6" -> (known after apply)
          ~ tenant_id    = "7788edaf-0346-4068-9d79-c868aed15b3d" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ protocols (known after apply)
      - protocols {
          - enable_http2 = false -> null
        }

      ~ security (known after apply)
      - security {
          - enable_backend_ssl30                                = false -> null
          - enable_backend_tls10                                = false -> null
          - enable_backend_tls11                                = false -> null
          - enable_frontend_ssl30                               = false -> null
          - enable_frontend_tls10                               = false -> null
          - enable_frontend_tls11                               = false -> null
          - tls_ecdhe_ecdsa_with_aes128_cbc_sha_ciphers_enabled = false -> null
          - tls_ecdhe_ecdsa_with_aes256_cbc_sha_ciphers_enabled = false -> null
          - tls_ecdhe_rsa_with_aes128_cbc_sha_ciphers_enabled   = false -> null
          - tls_ecdhe_rsa_with_aes256_cbc_sha_ciphers_enabled   = false -> null
          - tls_rsa_with_aes128_cbc_sha256_ciphers_enabled      = false -> null
          - tls_rsa_with_aes128_cbc_sha_ciphers_enabled         = false -> null
          - tls_rsa_with_aes128_gcm_sha256_ciphers_enabled      = false -> null
          - tls_rsa_with_aes256_cbc_sha256_ciphers_enabled      = false -> null
          - tls_rsa_with_aes256_cbc_sha_ciphers_enabled         = false -> null
          - tls_rsa_with_aes256_gcm_sha384_ciphers_enabled      = false -> null
          - triple_des_ciphers_enabled                          = false -> null
        }

      ~ sign_in (known after apply)
      - sign_in {
          - enabled = false -> null
        }

      ~ tenant_access (known after apply)
      - tenant_access {
          - enabled       = false -> null
          - primary_key   = (sensitive value) -> null
          - secondary_key = (sensitive value) -> null
          - tenant_id     = "/tenant/access" -> null
        }

        # (2 unchanged blocks hidden)
    }

  # module.apim_itn.module.apim_v2.azurerm_api_management_diagnostic.applicationinsights[0] must be replaced
  # (imported from "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/diagnostics/applicationinsights")
  # Warning: this will destroy the imported resource
-/+ resource "azurerm_api_management_diagnostic" "applicationinsights" {
        always_log_errors         = true
      ~ api_management_logger_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/loggers/io-p-itn-apim-01-logger" -> (known after apply)
      ~ api_management_name       = "io-p-itn-apim-01" -> "io-p-itn-apim-01-autoscale" # forces replacement
        http_correlation_protocol = "W3C"
      ~ id                        = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/diagnostics/applicationinsights" -> (known after apply)
        identifier                = "applicationinsights"
      ~ log_client_ip             = true -> (known after apply)
        operation_name_format     = null
        resource_group_name       = "io-p-itn-common-rg-01"
        sampling_percentage       = 5
        verbosity                 = "error"

      ~ backend_request (known after apply)
      - backend_request {
          - body_bytes     = 0 -> null
          - headers_to_log = [] -> null
        }

      ~ backend_response (known after apply)
      - backend_response {
          - body_bytes     = 0 -> null
          - headers_to_log = [] -> null
        }

      ~ frontend_request (known after apply)
      - frontend_request {
          - body_bytes     = 0 -> null
          - headers_to_log = [] -> null
        }

      ~ frontend_response (known after apply)
      - frontend_response {
          - body_bytes     = 0 -> null
          - headers_to_log = [] -> null
        }
    }

  # module.apim_itn.module.apim_v2.azurerm_api_management_diagnostic.this[0] will be destroyed
  # (because azurerm_api_management_diagnostic.this is not in configuration)
  - resource "azurerm_api_management_diagnostic" "this" {
      - always_log_errors         = true -> null
      - api_management_logger_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/loggers/io-p-itn-apim-01-logger" -> null
      - api_management_name       = "io-p-itn-apim-01" -> null
      - http_correlation_protocol = "W3C" -> null
      - id                        = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/diagnostics/applicationinsights" -> null
      - identifier                = "applicationinsights" -> null
      - log_client_ip             = true -> null
      - resource_group_name       = "io-p-itn-common-rg-01" -> null
      - sampling_percentage       = 5 -> null
      - verbosity                 = "error" -> null
        # (1 unchanged attribute hidden)

      - backend_request {
          - body_bytes     = 0 -> null
          - headers_to_log = [] -> null
        }

      - backend_response {
          - body_bytes     = 0 -> null
          - headers_to_log = [] -> null
        }

      - frontend_request {
          - body_bytes     = 0 -> null
          - headers_to_log = [] -> null
        }

      - frontend_response {
          - body_bytes     = 0 -> null
          - headers_to_log = [] -> null
        }
    }

  # module.apim_itn.module.apim_v2.azurerm_api_management_logger.this[0] must be replaced
-/+ resource "azurerm_api_management_logger" "this" {
      ~ api_management_name = "io-p-itn-apim-01" -> "io-p-itn-apim-01-autoscale" # forces replacement
      ~ id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/loggers/io-p-itn-apim-01-logger" -> (known after apply)
      ~ name                = "io-p-itn-apim-01-logger" -> "io-p-itn-apim-01-autoscale-logger" # forces replacement
        # (4 unchanged attributes hidden)

      ~ application_insights {
          + connection_string   = (sensitive value)
          - instrumentation_key = (sensitive value) -> null
        }
    }

  # module.apim_itn.module.apim_v2.azurerm_monitor_autoscale_setting.this[0] must be replaced
-/+ resource "azurerm_monitor_autoscale_setting" "this" {
      ~ id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Insights/autoScaleSettings/io-p-itn-apim-01-autoscale" -> (known after apply)
      ~ name                = "io-p-itn-apim-01-autoscale" -> "io-p-itn-apim-as-01" # forces replacement
      - tags                = {} -> null
      ~ target_resource_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)

      ~ profile {
            name = "default"

          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }

            # (1 unchanged block hidden)
        }
    }

  # module.apim_itn.module.apim_v2.azurerm_monitor_metric_alert.this["capacity"] must be replaced
-/+ resource "azurerm_monitor_metric_alert" "this" {
      ~ id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Insights/metricAlerts/io-p-itn-apim-01-CAPACITY" -> (known after apply)
      ~ name                     = "io-p-itn-apim-01-CAPACITY" -> "io-p-itn-apim-01-autoscale-CAPACITY" # forces replacement
      ~ scopes                   = [
          - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01",
        ] -> (known after apply)
      - tags                     = {} -> null
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
        # (7 unchanged attributes hidden)

      - action {
          - action_group_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/actionGroups/ioperror" -> null
          - webhook_properties = {} -> null
        }
      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/actionGroups/ioperror"
        }

        # (1 unchanged block hidden)
    }

  # module.apim_itn.module.apim_v2.azurerm_monitor_metric_alert.this["duration"] must be replaced
-/+ resource "azurerm_monitor_metric_alert" "this" {
      ~ id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Insights/metricAlerts/io-p-itn-apim-01-DURATION" -> (known after apply)
      ~ name                     = "io-p-itn-apim-01-DURATION" -> "io-p-itn-apim-01-autoscale-DURATION" # forces replacement
      ~ scopes                   = [
          - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01",
        ] -> (known after apply)
      - tags                     = {} -> null
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
        # (7 unchanged attributes hidden)

      - action {
          - action_group_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/actionGroups/ioperror" -> null
          - webhook_properties = {} -> null
        }
      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/actionGroups/ioperror"
        }

        # (1 unchanged block hidden)
    }

  # module.apim_itn.module.apim_v2.azurerm_monitor_metric_alert.this["requests_failed"] must be replaced
-/+ resource "azurerm_monitor_metric_alert" "this" {
      ~ id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Insights/metricAlerts/io-p-itn-apim-01-REQUESTS_FAILED" -> (known after apply)
      ~ name                     = "io-p-itn-apim-01-REQUESTS_FAILED" -> "io-p-itn-apim-01-autoscale-REQUESTS_FAILED" # forces replacement
      ~ scopes                   = [
          - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01",
        ] -> (known after apply)
      - tags                     = {} -> null
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
        # (7 unchanged attributes hidden)

      - action {
          - action_group_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/actionGroups/ioperror" -> null
          - webhook_properties = {} -> null
        }
      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/actionGroups/ioperror"
        }

        # (1 unchanged block hidden)
    }

  # module.apim_itn.module.apim_v2.azurerm_network_security_group.nsg_apim will be imported
    resource "azurerm_network_security_group" "nsg_apim" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/networkSecurityGroups/io-p-itn-apim-nsg-01"
        location            = "italynorth"
        name                = "io-p-itn-apim-nsg-01"
        resource_group_name = "io-p-itn-common-rg-01"
        security_rule       = [
            {
                access                                     = "Allow"
                description                                = null
                destination_address_prefix                 = "VirtualNetwork"
                destination_address_prefixes               = []
                destination_application_security_group_ids = []
                destination_port_range                     = "3443"
                destination_port_ranges                    = []
                direction                                  = "Inbound"
                name                                       = "managementapim"
                priority                                   = 100
                protocol                                   = "Tcp"
                source_address_prefix                      = "ApiManagement"
                source_address_prefixes                    = []
                source_application_security_group_ids      = []
                source_port_range                          = "*"
                source_port_ranges                         = []
            },
        ]
        tags                = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
    }

  # module.apim_itn.module.apim_v2.azurerm_private_dns_a_record.apim_azure_api_net must be replaced
  # (imported from "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/azure-api.net/A/io-p-itn-apim-01")
  # Warning: this will destroy the imported resource
-/+ resource "azurerm_private_dns_a_record" "apim_azure_api_net" {
      ~ fqdn                = "io-p-itn-apim-01.azure-api.net." -> (known after apply)
      ~ id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/azure-api.net/A/io-p-itn-apim-01" -> (known after apply)
      ~ name                = "io-p-itn-apim-01" -> "io-p-itn-apim-01-autoscale" # forces replacement
      ~ records             = [
          - "10.20.100.4",
        ] -> (known after apply)
        resource_group_name = "io-p-rg-common"
        tags                = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        ttl                 = 3600
        zone_name           = "azure-api.net"
    }

  # module.apim_itn.module.apim_v2.azurerm_private_dns_a_record.apim_management_azure_api_net must be replaced
  # (imported from "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/management.azure-api.net/A/io-p-itn-apim-01")
  # Warning: this will destroy the imported resource
-/+ resource "azurerm_private_dns_a_record" "apim_management_azure_api_net" {
      ~ fqdn                = "io-p-itn-apim-01.management.azure-api.net." -> (known after apply)
      ~ id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/management.azure-api.net/A/io-p-itn-apim-01" -> (known after apply)
      ~ name                = "io-p-itn-apim-01" -> "io-p-itn-apim-01-autoscale" # forces replacement
      ~ records             = [
          - "10.20.100.4",
        ] -> (known after apply)
        resource_group_name = "io-p-rg-common"
        tags                = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        ttl                 = 3600
        zone_name           = "management.azure-api.net"
    }

  # module.apim_itn.module.apim_v2.azurerm_private_dns_a_record.apim_scm_azure_api_net must be replaced
  # (imported from "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/scm.azure-api.net/A/io-p-itn-apim-01")
  # Warning: this will destroy the imported resource
-/+ resource "azurerm_private_dns_a_record" "apim_scm_azure_api_net" {
      ~ fqdn                = "io-p-itn-apim-01.scm.azure-api.net." -> (known after apply)
      ~ id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/scm.azure-api.net/A/io-p-itn-apim-01" -> (known after apply)
      ~ name                = "io-p-itn-apim-01" -> "io-p-itn-apim-01-autoscale" # forces replacement
      ~ records             = [
          - "10.20.100.4",
        ] -> (known after apply)
        resource_group_name = "io-p-rg-common"
        tags                = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        ttl                 = 3600
        zone_name           = "scm.azure-api.net"
    }

  # module.apim_itn.module.apim_v2.azurerm_subnet_network_security_group_association.snet_nsg will be imported
    resource "azurerm_subnet_network_security_group_association" "snet_nsg" {
        id                        = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-apim-snet-01"
        network_security_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/networkSecurityGroups/io-p-itn-apim-nsg-01"
        subnet_id                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-apim-snet-01"
    }

  # module.global.module.dns.azurerm_dns_a_record.api_internal_io_italia_it will be updated in-place
  ~ resource "azurerm_dns_a_record" "api_internal_io_italia_it" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/dnsZones/io.italia.it/A/api-internal"
        name                = "api-internal"
      ~ records             = [
          - "10.20.100.4",
        ] -> (known after apply)
        tags                = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (5 unchanged attributes hidden)
    }

  # module.global.module.dns.azurerm_private_dns_a_record.api_app_internal_io will be updated in-place
  ~ resource "azurerm_private_dns_a_record" "api_app_internal_io" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.Network/privateDnsZones/internal.io.pagopa.it/A/api-app"
        name                = "api-app"
      ~ records             = [
          - "10.20.100.4",
        ] -> (known after apply)
        tags                = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (4 unchanged attributes hidden)
    }

Plan: 6 to import, 19 to add, 3 to change, 23 to destroy.

Changes to Outputs:
  ~ apim              = {
      ~ itn = {
          ~ id                      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

Warning: Argument is deprecated

  with module.assets_cdn_weu.module.assets_cdn.azurerm_storage_account.this,
  on .terraform/modules/assets_cdn_weu.assets_cdn/storage_account/main.tf line 2, in resource "azurerm_storage_account" "this":
   2: resource "azurerm_storage_account" "this" {

this block has been deprecated and superseded by the
`azurerm_storage_account_static_website` resource and will be removed in v5.0
of the AzureRM provider

(and 18 more similar warnings elsewhere)
::error::Terraform exited with code 1.
```

</details>
